Autodesk.Revit.DB.TextElement.Align
The align.
Since:
2012

Autodesk.Revit.DB.TextElement.Height
The height.
Since:
2012

Autodesk.Revit.DB.TextElement.LineWidth
The line width.
Since:
2012

Autodesk.Revit.DB.TextElement.BaseDirection
The base direction.
Since:
2012

Autodesk.Revit.DB.TextElement.UpDirection
The direction towards the top of the screen.
Since:
2012

Autodesk.Revit.DB.TextElement.Text
Get and set the content of the TextElement object.
Remarks: The content of TextElement object can also be accessed through
the Built-In parameter TEXT_TEXT.

Autodesk.Revit.DB.TextElement
Represents the TextElement.
Remarks: This class can be parent class of TextNote and other Text related classes.